# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи —
# первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.

# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
#
# out
#
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

name_list = "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

name_result = {}

for name in name_list:
    key = name[0].capitalize()

    if key not in name_result:
        name_result[key] = []
    name_result[key].append(name)

print(name_list)
print (name_result)